//=============================================================================
//
// ライト処理 [light.h]
// Author :		荒谷由朗
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "main.h"

#define MAX_LIGHT		(3)			// ライトの最大数

//=============================================================================
// クラスの定義
//=============================================================================
class CLight
{
public:
	CLight();
	~CLight();
	CLight *Create();

	void Init	(void);
	void Uninit	(void);
	void Update	(void);
private:
	D3DLIGHT9 m_light[MAX_LIGHT];	// ライトの情報
};
#endif